# JointSizeMismatch Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConnectorFailures..::..JointSizeMismatch Property
BuiltInFailures..::..ConnectorFailures Class See Also
---
The element has a connector with a fitting joint size mismatch
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId JointSizeMismatch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property JointSizeMismatch As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ JointSizeMismatch {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConnectorFailures Class
Autodesk.Revit.DB Namespace